Revit 2027 API
SiteLocation.ConvertFromProjectTime Method
Converts project time to UTC time.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DateTime ConvertFromProjectTime(
	DateTime projectTime
)
Public Function ConvertFromProjectTime (
	projectTime As DateTime
) As DateTime
public:
DateTime ConvertFromProjectTime(
	DateTime projectTime
)
member ConvertFromProjectTime :
        projectTime : DateTime -> DateTime
Parameters
projectTime DateTime
The project time.
Return Value
DateTime
Exceptions
Exception | Condition
ArgumentException |  Thrown when the projectTime's kind is not Unspecified.
Remarks
Daylight savings time is not considered during this conversion.
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace